{
  "companies": [
    {
      "name": "Toumei Consulting / Disney Studio Tech",
      "title": "Software Engineer",
      "duration": "August 2018 - Present",
      "location": "Glendale, CA",
      "description": "Develop single page applications as a servicing tool to support Disney direct-to-consumer initiatives. Write health check services to ensure uptime with integrated systems. Build database migration scripts via Knex to manage data population and schema updates across all environments. Deliver code with automated testing for APIs and UI components to increase code confidence and decrease manual regression testing. Monitor and debug deployment build issues in Jenkins and Openshift.", 
      "tags": [
        "HTML5",
        "CSS3",
        "Javascript",
        "React",
        "Redux",
        "Node.js",
        "PostgreSQL"
      ]
    },
    {
      "name": "Laurel & Wolf",
      "title": "Software Engineer",
      "duration": "January 2018 - August 2018",
      "location": "West Hollywood, CA",
      "description": "Developed and launched React Native mobile application as part of the company’s growth team initiative. Integrated Google Analytics event tracking to gain insight on user behaviors and help drive business decisions. Introduced default payment option for customer shopping checkout. Reworked customer shopping list by building modular components to reflect new designs.", 
      "tags": [
        "HTML5",
        "CSS3",
        "Javascript",
        "React",
        "Redux",
        "Ruby on Rails",
        "PostgreSQL"
      ]
    },
    {
      "name": "Dumo",
      "title": "Software Engineer",
      "duration": "January 2017 - Present",
      "location": "Los Angeles, CA",
      "description": "Built single page application to deliver over 25 new product features including dashboard view, analytics, and user settings. Developed RESTful APIs to aggregate user growth and revenue trends. Implemented recipient payout system using Stripe API. Integrated Twitter, Instagram, and Facebook for better login experience. Set up email campaigns using Mailchimp API and Foundation for Email.",
      "tags": [
        "HTML5",
        "CSS3",
        "Javascript",
        "React",
        "Redux",
        "Node.js",
        "MySQL"
      ]
    },
    {
      "name": "Channelmeter",
      "title": "Software Engineer Intern",
      "duration": "June 2016 - September 2016",
      "location": "San Francisco, CA",
      "description": "Integrated Instagram API to build analytics tool for user media content. Introduced group chat and notification systems for messenger application. Redesigned and developed user dashboard settings for a more extensive and fluid administrative control. Refactored React codebase to reduce complexity and increase code reusability by introducing smarter shared components.",
      "tags": [
        "HTML5",
        "CSS3",
        "Coffeescript",
        "React",
        "Flux",
        "Node.js",
        "MySQL"
      ]
    }
  ]
}